Repository: JoanJaraBosch/TFG
Catalog: odroid/locale/*/LC_MESSAGES/django.po
Languages: es

source: Sobre nosaltres
es: Sobre nosotros

source: Equip
es: Equipo

source: Estudiants
es: Estudiantes

source: Professors
es: Profesores

source: A continuació, podreu veure informació sobre els professors implicats en el nostre projecte, tot i què el nostre professor principal ha estat en Carles Aliagas ja que ens ha fet de tutor del treball de fi de carrera.
es: A continuación, podréis ver información sobre los profesores implicados en el nuestro proyecto, todo y que nuestro profesor principal ha estado en Carles Aliagas puesto que nos ha hecho de tutor del trabajo de fin de carrera.

source: Monitorització
es: Monitorización

source: Manteniment
es: Mantenimiento

source: Descàrregues
es: Descárgas

source: Iniciar Sessió
es: Iniciar Sesión

source: Tancar Sessió
es: Cerrar Sesión

source: i
es: y

source: Made with
es: Hecho con

source: by
es: por

source: Descripció
es: Descripción

source: Automatització
es: Automatización

source: Descàrrega per la automatització
es: Descarga de la automatización

source: Monitorització i manteniment
es: Monitorización y mantenimiento

source: Descàrrega pel manteniment i monitorització
es: Descarga para el mantenimiento y monitorización

source: Descàrrega del manual
es: Descarga del manual

source: A continuació disposa d'un enllaç per a visitar la pàgina de les plaques/ordinadors que utilitzem.
es: A continuación dispone de un enlace para visitar la página de las placas/ordinadores que utilizaremos.

source: Plaques Odroid
es: Placas Odroid

source: Nom d'usuari:
es: Nombre de usuario:

source: Contrasenya:
es: Contraseña:

source: Connect
es: Connectar

source: Remove Output
es: Eliminar output

source: Send Command
es: Enviar comando

source: INPUT TERMINAL:
es: TERMINAL DE INPUT:

source: OUTPUT TERMINAL:
es: TERMINAL DE OUTPUT:

source: OUTPUT ERROR TERMINAL:
es: TERMINAL DE ERROR DE OUTPUT

source: Introducció
es: Introducción

source: Aquest manual té el propòsit de permetre a l'usuari instal·lar de manera automatitzada un sistema de cues anomenat Slurm el qual permetrà que es pugui paral·lelitzar de manera adequada i eficient. A més a més, també automatitzarà la instal·lació de l'aplicació web per tal de monitorar i mantenir el nostre sistema.
es: Este manual tiene el propósito de pemitir al usuario inntalar de manera automatitzada un sistema de colas llamado Slurm el cual permitirá que se pueda paralelizar de manera adecuada y eficiente. Además, tambien automatitzará la instalación de la aplicación web para poder hacer la monitorización y mantener nuestro sistema.

source: Swicth
es: Switch

source: Cables Ethernet (tants com plaques + 1 per el router)
es: Cables Ethernet (tantos como placas +1 para el router)

source: Un router amb connexió a Internet
es: Un router con conexión a Internet

source: Ratolí (opcional)
es: Ratón (opcional)

source: Tecla (opcional)
es: Teclado (opcional)

source: Pantalla amb connexió HDMI (opcional)
es: Pantalla con conexión HDMI (opcional)

source: Instal·lació
es: Intalación

source: Primer de tot necessitaràs un lloc on posar les teves plaques Odroid de manera que el cada cable Ethernet anirà a un port del Swicth i al port Ethernet de les plaques. Després hauràs de connectar l'adaptador USB Etehrnet i el cable Ethernet d'aquest USB al router. De manera opcional podràs posar el HDMI, el ratolí i el teclat a la placa màster per tal de configurar-la amb l'ajuda d'una pantalla. En cas de no vulgueu posar el material opcional, haureu d'anar a la configuració del router per saber la IP de la placa màster de manera LAN i connectar-se per SSH de la següent manera: ssh odroid@ip On haurà de posar de contrasenya Odroid. Ara ja està llest per passar a l'apartat de descàrregues.
es: Primero de todo necesitarñas un lugar donde poner tus placas Odroid de manera que el cada cable Ethernet irá de un puerto ethernet del switch a un puerto ethhernet de las placas. Después tendrás que conectar el adaptador USB a Ethernet y el cable Ethernet del USB al router. De manera opcional podrás poner el HDMI, el ratolón y el teclado a la placa master para poder configurarla con la ayuda de una pantalla. En caso de no querer poner el material opcional, tendreis que ir a la configuración del router pera saber la IP de la placa master de manera LAN y connectarse por SSH de la siguiente manera: ssh odroid@ip Donde tendras que poner de contraseña Odroid. Ahora ya estas listo para pasar al apartado de descárgas.

source: Descàrrega, descompressió i instal·lació d’arxius
es: Descarga, descompresión y instalación de archivos

source: Un cop dintre a la terminal de la nostra placa màster, aneu al directori Documents amb la següent comanda:
es: Una vez esteis dentro en la terminal, teneis que ir al directorio Documents con la siguiente comanda:

source: Un cop dintre el directori, heu de descarregar els arxius per a la automatització. Haureu d’executar la següent comanda:
es: Una vez dentro del directorio, teneis que descargar los archivos para hacer la automatitzación. Tendreis que ejecutar la siguiente comanda:

source: Ara haureu de descomprimir el fitxer master.zip amb la següent comanda:
es: Ahora tendreis que descomprimir el archivo master.zip de la siguiente manera:

source: Un cop descomprimit, aneu dintre el directori que heu descomprimit amb la comanda següent:
es: Una vez descomprimido, teneis que ir al directorio creado con la descompresión con la siguiente comanda:

source: Fnalment, executeu el script com a sudo de la següent manera:
es: Finalmente, solo teneis que ejecutar el script como sudo de la siguiente manera:

source: Aplicació web
es: Aplicación web

source: Per a poder veure la plana web, només cal que aneu a un navegador d’un ordinador que estigui a la mateixa LAN que la placa màster i posseu https://ipOdroid. On ipOdroid serà la ip de la LAN Odroid. Seguidament haura d’acceptar els permisos ja que hem generat un certificat autosignat per tal d’establir una conexió segura en el nostre servidor. Ara hauria de poder veure la aplicació web. En cas de que estigui utilitzant Firefox, haurà d’anar també a la següent plana web: https://ipOdroid:3000 per tal d’acceptar els certificats per el servidor node encarregat d’enviar les dades a l’aplicació web. Finalment, necessitarà entrar amb usuari i contrasenya odroid odroid per a poder monitoritzar i mantenir les plaques. Per a usar la placa amb més d’un usuari, haurà d’anar a https://ipOdroid/admin on estarà a la plana d’administrador per a poguer crear els usuaris necessaris encarregats de monitoritzar les plaques.
es: Para poder ver la plana web, teneis que ir a un navegador web de un ordenador que este en la misma zona LAN y poner la sigueinte dirección https://ipOdroid. Donde ipOdroid será la ip de la LAN Odroid. Seguidamente debereis aceptar los permisos porque hemos generado certificados autofirmados para establecer una conexión segura en nuestro servidor. Ahora debería poder ver la aplicación web. En caso de que este utilitzando Firefox, deberá acceder al siguiente enlace https://ipOdroid:3000 para aceptar los permisos del servidor node encargado de enviar los datos para los gráficos. Finalmente, necessitará entrar con usuario y contraseña odroid odroid para poder monitoritzar y mantener las placas. Para usar la placa con más de un usuario , tendrá que acceder al siguiente enlace https://ipOdroid/admin donde estaráa la plana de administrador para poder crear más usuarios y administrarlos para así monitoritzar las placas.

source: Continue Monitoring
es: Continuar con la monitorización

source: Pause Monitoring
es: Pausar la monitorización

source: Stop Monitoring
es: Parar la monitorización

source: Nombre de punts pels grafics lineals:
es: Cantidad de puntos por gráfico lineal:

source: Delay en segons per la obtenció de dades:
es: Retraso en segundos para la obtención de los datos:
